#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПоследнийИдентификатор(Бот) Экспорт
	Идентификатор = Неопределено;
	
	МенеджерЗаписи = РегистрыСведений.ИдентификаторыПоследнихОбновлений.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Бот = Бот;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Идентификатор = МенеджерЗаписи.Идентификатор;
	КонецЕсли;
	
	Возврат Идентификатор;
КонецФункции

Процедура ОбновитьПоследнийИдентификатор(Бот, Идентификатор) Экспорт
	МенеджерЗаписи = РегистрыСведений.ИдентификаторыПоследнихОбновлений.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Бот = Бот;
	МенеджерЗаписи.Идентификатор = Идентификатор;
	МенеджерЗаписи.Записать();
КонецПроцедуры

#КонецОбласти

#КонецЕсли